InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиЧастичногоВыбытияПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЧастичногоВыбытияПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НоменклатураЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыТоваровSKU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровSKU</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ШаблоныШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ШаблоныШтрихкодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НоменклатураШтучный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураВесовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураФасованный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерийныйНомерСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураСИЗ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотоаппараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Антисептики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БАДы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НикотиносодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗерна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоковаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольноеПиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорепродуктыПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияСАТУРН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗерноВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗернаВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МясоПодконтрольноеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеринарныеПрепараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИгрыИИгрушкиДляДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РадиоэлектроннаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТитановаяМеталлопродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РастительныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоволокноИОптоволоконнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтопительныеПриборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бакалея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукцияДо9Процентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефоныИНоутбуки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабельнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоторныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольныеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПивоВПотребительскихУпаковках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническиеСредстваРеабилитации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность2025</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхВлажныеБезВЕТИС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыУпаковок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МаркированныйТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонотоварнаяУпаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МультитоварнаяУпаковка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыСтруктурныхЕдиниц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозницаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МагазинГруппаСкладов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДисконтныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ДисконтныеКарты</Name>
			<Comment>Магнитные, штриховые и смешанные дисконтные карты</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыДисконтныхКарт</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКартыШтрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКартыМагнитный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаНедействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСоШтрихкодамиУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьПрефиксыШтрихкодовНоменклатуры.
Процедура ЗаполнитьПрефиксыШтрихкодовНоменклатуры(СтруктураПрефиксов) Экспорт
	
	Префикс = НСтр("ru='2'");
	
	СтруктураПрефиксов = Новый ТаблицаЗначений;
	СтруктураПрефиксов.Колонки.Добавить("Ключ");
	СтруктураПрефиксов.Колонки.Добавить("Значение");
	
	ПрефиксыВесовыхШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.ПрефиксыВесовыхШтрихкодов();
	
	Для Каждого ПрефиксВесовогоШтрихкода Из ПрефиксыВесовыхШтрихкодов Цикл
		Доб1 = СтруктураПрефиксов.Добавить();
		Доб1.Ключ = "НоменклатураВесовой";
		Доб1.Значение = Префикс + ПрефиксВесовогоШтрихкода;
	КонецЦикла;
	
	Доб1 = СтруктураПрефиксов.Добавить();
	Доб1.Ключ = "НоменклатураШтучный";
	Доб1.Значение=  Префикс + Константы.ПрефиксВнутреннегоШтрихкодаШтучногоТовара.Получить();
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетСредствИндивидуальнойЗащиты") Тогда
		Доб1 = СтруктураПрефиксов.Добавить();
		Доб1.Ключ = "НоменклатураСИЗ";
		Доб1.Значение= НСтр("ru='24'");
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШтрихкоды.
Процедура ДобавитьТекстЗапросаШтрихкоды(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Номенклатура КАК Владелец,
	|	Штрихкоды.Характеристика КАК Характеристика,
	|	Штрихкоды.ЕдиницаИзмерения КАК Упаковка,
	|	NULL КАК Серия,
	|	Штрихкоды.Партия КАК Партия,
	|	1 КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураШтучный) КАК ШаблонШтрихкода
	|ПОМЕСТИТЬ ШтрихкодыВсе
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Серия", "СерииНоменклатуры.Ссылка КАК Серия");
		ТекстЗапроса = ТекстЗапроса + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|		ПО Штрихкоды.Номенклатура = СерииНоменклатуры.Владелец
			|			И (Штрихкоды.Номенклатура.ИспользоватьСерииНоменклатуры)
			|			И Штрихкоды.Штрихкод = СерииНоменклатуры.Наименование
			|			И НЕ СерииНоменклатуры.ПометкаУдаления
			|			И НЕ СерииНоменклатуры.Продан";
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("МассивУжеДобавленныхСерий") Тогда
			ТекстЗапроса = ТекстЗапроса + " И НЕ СерииНоменклатуры.Ссылка В (&МассивУжеДобавленныхСерий)";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФильтрПоискаПоШтрихкоду.Количество() > 0 Тогда
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЗаданнаяТаблицаНоменклатуры") Тогда
			
			ТекстЗапроса =
				"ВЫБРАТЬ
				|	Выразить(&Штрихкод КАК Строка(200)) КАК Штрихкод,
				|	Штрихкоды.Номенклатура КАК Владелец,
				|	Штрихкоды.Характеристика КАК Характеристика,
				|	Штрихкоды.Упаковка КАК Упаковка
				|ПОМЕСТИТЬ ТаблицаНоменклатуры
				|ИЗ
				|	&ЗаданнаяТаблицаНоменклатуры КАК Штрихкоды
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Штрихкоды.Штрихкод КАК Штрихкод,
				|	Штрихкоды.Владелец КАК Владелец,
				|	Штрихкоды.Характеристика КАК Характеристика,
				|	Штрихкоды.Упаковка КАК Упаковка,
				|	NULL КАК Серия,
				|	NULL КАК Партия,
				|	1 КАК Количество,
				|	НЕОПРЕДЕЛЕНО КАК ШаблонШтрихкода
				|ПОМЕСТИТЬ ШтрихкодыВсе
				|ИЗ
				|	ТаблицаНоменклатуры КАК Штрихкоды";
			
				Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоКодМаркировки") Тогда
					ТекстЗапроса = ТекстЗапроса + "
						|ГДЕ НЕ ИСТИНА В
						|(ВЫБРАТЬ ПЕРВЫЕ 1
						|	ИСТИНА КАК НайденШтрихкодМарки
						|ИЗ
						|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
						|ГДЕ
						|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ШтрихкодМарки
						|	И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка))";
				КонецЕсли;
				
				МассивЗапросов.Добавить(ТекстЗапроса);
				Возврат;
				
		КонецЕсли;
		
		Если Не ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
			ТекстЗапроса = ТекстЗапроса + " ГДЕ ЛОЖЬ";
			МассивЗапросов.Добавить(ТекстЗапроса);
			Возврат;
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ Штрихкоды.Штрихкод = &Штрихкод
			|	И НЕ Штрихкоды.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка)";
		
		ТекстЗапроса = ТекстЗапроса + "
			|	И НЕ (Штрихкоды.Номенклатура, Штрихкоды.Характеристика) В
			|	(ВЫБРАТЬ
			|	НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия КАК Номенклатура,
			|	НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия КАК Характеристика
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЧастичногоВыбытияПродукцииИС КАК НастройкиЧастичногоВыбытияПродукцииИС
			|		ПО (ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод)
			|			И ШтрихкодыНоменклатуры.Номенклатура = НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура
			|			И ШтрихкодыНоменклатуры.Характеристика = НастройкиЧастичногоВыбытияПродукцииИС.Характеристика
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			|		ПО ШтрихкодыНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
			|			И НЕ (СпрНоменклатура.ВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Алкогольная)))";
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоКодМаркировки") Тогда
			ТекстЗапроса = ТекстЗапроса + "
				| И НЕ ИСТИНА В
				|(ВЫБРАТЬ ПЕРВЫЕ 1
				|	ИСТИНА КАК НайденШтрихкодМарки
				|ИЗ
				|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
				|ГДЕ
				|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ШтрихкодМарки
				|	И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка))";
		КонецЕсли;
		
	КонецЕсли;
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
	Если ФильтрПоискаПоШтрихкоду.Количество() > 0 Тогда
		
		Если Не ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
			Возврат;
		КонецЕсли;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод,
		|	НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия,
		|	НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия,
		|	Штрихкоды.ЕдиницаИзмерения,
		|	NULL,
		|	Штрихкоды.Партия,
		|	1,
		|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураШтучный)
		|ИЗ
		|	(ВЫБРАТЬ
		|		ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|		ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|		ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|		ШтрихкодыНоменклатуры.Партия КАК Партия,
		|		ШтрихкодыНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|	ИЗ
		|		РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|	ГДЕ
		|		ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
		|		И НЕ ШтрихкодыНоменклатуры.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка)) КАК Штрихкоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЧастичногоВыбытияПродукцииИС КАК НастройкиЧастичногоВыбытияПродукцииИС
		|		ПО Штрихкоды.Номенклатура = НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура
		|			И Штрихкоды.Характеристика = НастройкиЧастичногоВыбытияПродукцииИС.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО (НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия = СпрНоменклатура.Ссылка)
		|ГДЕ
		|	НЕ НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура ЕСТЬ NULL
		|	И СпрНоменклатура.ВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Алкогольная)";
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоКодМаркировки") Тогда
			ТекстЗапроса = ТекстЗапроса + "
				| И НЕ ИСТИНА В
				|(ВЫБРАТЬ ПЕРВЫЕ 1
				|	ИСТИНА КАК НайденШтрихкодМарки
				|ИЗ
				|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
				|ГДЕ
				|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ШтрихкодМарки
				|	И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка))";
		КонецЕсли;
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаСерии.
Процедура ДобавитьТекстЗапросаСерии(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры")
		И ФильтрПоискаПоШтрихкоду.Свойство("СерииНоменклатуры") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Наименование,
		|	СерииНоменклатуры.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Владелец = &НоменклатураДляПоискаСерии
		|	И СерииНоменклатуры.Наименование = &Штрихкод
		|	И НЕ СерииНоменклатуры.ПометкаУдаления
		|	И НЕ СерииНоменклатуры.Продан";
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("МассивУжеДобавленныхСерий") Тогда
			ТекстЗапроса = ТекстЗапроса + " И НЕ СерииНоменклатуры.Ссылка В (&МассивУжеДобавленныхСерий)";
		КонецЕсли;
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоВозвратПродажи") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И НЕ СерииНоменклатуры.Продан", "И СерииНоменклатуры.Продан");
		КонецЕсли;
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии")
		И ФильтрПоискаПоШтрихкоду.Свойство("СерииНоменклатуры") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПартииНоменклатуры.Наименование,
		|	ПартииНоменклатуры.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
		|ГДЕ
		|	ПартииНоменклатуры.Владелец = &НоменклатураДляПоискаСерии
		|	И ПартииНоменклатуры.Наименование = &Штрихкод
		|	И НЕ ПартииНоменклатуры.ПометкаУдаления
		|	И НЕ ПартииНоменклатуры.Недействителен";
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаКодыSKU.
Процедура ДобавитьТекстЗапросаКодыSKU(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ШаблонКодТовараSKU") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КодыТоваровSKU.SKU,
	|	КодыТоваровSKU.Номенклатура,
	|	КодыТоваровSKU.Характеристика,
	|	КодыТоваровSKU.ЕдиницаИзмерения,
	|	NULL,
	|	КодыТоваровSKU.Партия,
	|	&КоличествоТовара,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураВесовой)
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|ГДЕ
	|	КодыТоваровSKU.SKU = &КодТовара
	|	И НЕ КодыТоваровSKU.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&КодТовара,
	|	Штрихкоды.Номенклатура,
	|	Штрихкоды.Характеристика,
	|	Штрихкоды.ЕдиницаИзмерения,
	|	NULL,
	|	Штрихкоды.Партия,
	|	&КоличествоТовара,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураВесовой)
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &ШтрихкодСНулевымВесом
	|	И &КоличествоТовара > 0
	|	И НЕ Штрихкоды.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров.
Процедура ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	Если СУсловиемПоиска И НЕ ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьЗапросПолногоВыбытия = Истина;
	ДобавитьЗапросЧастичногоВыбытия = Истина;
	Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоМаркаКТекущейСтроке") Тогда
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоТекущаяСтрокаЧастичногоВыбытия") Тогда
			ДобавитьЗапросПолногоВыбытия = Ложь;
		Иначе
			ДобавитьЗапросЧастичногоВыбытия = Ложь;
		КонецЕсли;
	Иначе
		Если ФильтрПоискаПоШтрихкоду.Свойство("РанееМаркаВыбывалаЧастично") Тогда
			ДобавитьЗапросПолногоВыбытия = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавитьЗапросПолногоВыбытия Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Штрихкоды.ЗначениеШтрихкода,
		|	Штрихкоды.Ссылка,
		|	Штрихкоды.Характеристика,
		|	ВЫБОР
		|		КОГДА Штрихкоды.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
		|			ТОГДА Штрихкоды.Упаковка
		|		ИНАЧЕ Значение(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Штрихкоды.Серия ССЫЛКА Справочник.СерииНоменклатуры
		|			ТОГДА Штрихкоды.Серия
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Штрихкоды.Серия ССЫЛКА Справочник.ПартииНоменклатуры
		|			ТОГДА Штрихкоды.Серия
		|	КОНЕЦ,
		|	ВЫБОР
		|	КОГДА Штрихкоды.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		|		И НЕ Штрихкоды.Количество = 0
		|			ТОГДА Штрихкоды.Количество
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК Штрихкоды";
		
		Если СУсловиемПоиска Тогда
			ТекстЗапроса = ТекстЗапроса + " ГДЕ Штрихкоды.ЗначениеШтрихкода = &ШтрихкодМарки
				| И НЕ Штрихкоды.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка)";
		КонецЕсли;
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если Не СУсловиемПоиска Тогда
		Возврат;
	КонецЕсли;
	
	Если ДобавитьЗапросЧастичногоВыбытия Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Штрихкоды.ЗначениеШтрихкода,
		|	НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия,
		|	НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия,
		|	Штрихкоды.Упаковка,
		|	Штрихкоды.Серия,
		|	Штрихкоды.Партия,
		|	Штрихкоды.Количество,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	(ВЫБРАТЬ
		|		ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|		ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|		ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|		ВЫБОР
		|			КОГДА ШтрихкодыУпаковокТоваров.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
		|				ТОГДА ШтрихкодыУпаковокТоваров.Упаковка
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|		КОНЕЦ КАК Упаковка,
		|		ВЫБОР
		|			КОГДА ШтрихкодыУпаковокТоваров.Серия ССЫЛКА Справочник.СерииНоменклатуры
		|				ТОГДА ШтрихкодыУпаковокТоваров.Серия
		|		КОНЕЦ КАК Серия,
		|		ВЫБОР
		|			КОГДА ШтрихкодыУпаковокТоваров.Серия ССЫЛКА Справочник.ПартииНоменклатуры
		|				ТОГДА ШтрихкодыУпаковокТоваров.Серия
		|		КОНЕЦ КАК Партия,
		|		ВЫБОР
		|			КОГДА ШтрихкодыУпаковокТоваров.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		|					И НЕ ШтрихкодыУпаковокТоваров.Количество = 0
		|				ТОГДА ШтрихкодыУпаковокТоваров.Количество
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК Количество
		|	ИЗ
		|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|	ГДЕ
		|		ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ШтрихкодМарки
		|		И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Штрихкоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЧастичногоВыбытияПродукцииИС КАК НастройкиЧастичногоВыбытияПродукцииИС
		|		ПО Штрихкоды.Номенклатура = НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура
		|			И Штрихкоды.Характеристика = НастройкиЧастичногоВыбытияПродукцииИС.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО (НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия = НоменклатураСпр.Ссылка)
		|ГДЕ
		|	НЕ НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия ЕСТЬ NULL
		|	И НоменклатураСпр.ВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Алкогольная)";
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаНоменклатурнойКлассификации.
Процедура ДобавитьТекстЗапросаНоменклатурнойКлассификации(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ВестиУчетСредствИндивидуальнойЗащиты") Тогда
		Возврат;
	КонецЕсли;
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	Если СУсловиемПоиска И НЕ ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Номенклатура.КодМедицинскогоИзделия,
	|	Номенклатура.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураСИЗ)
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";
	
	ТекстЗапроса = ТекстЗапроса + ?(СУсловиемПоиска,
		" ГДЕ Номенклатура.КодМедицинскогоИзделия = &Штрихкод",
		" ГДЕ НЕ Номенклатура.КодМедицинскогоИзделия = """" ");
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШаблоныРегистрацииКарт.
Процедура ДобавитьТекстЗапросаШаблоныРегистрацииКарт(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Возврат ;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаПоТелефону.
Процедура ДобавитьТекстЗапросаПоТелефону(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ИнформационныеКарты")
		И НЕ ФильтрПоискаПоШтрихкоду.Свойство("ПоследниеЦифрыТелефона") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&НомерТелефона,
	|	ЕСТЬNULL(ДисконтныеКарты.Ссылка, КонтрагентыКонтактнаяИнформация.Ссылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.Телефон)
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = ДисконтныеКарты.ВладелецКарты
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтрагентыКонтактнаяИнформация.ОбратныйНомерТелефона = &НомерТелефона";
	
	Если ФильтрПоискаПоШтрихкоду.Свойство("ПоследниеЦифрыТелефона") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОбратныйНомерТелефона = &НомерТелефона", "ОбратныйНомерТелефона ПОДОБНО &ШтрихкодИнверсия");
	КонецЕсли;
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаПоАдресуЭП.
Процедура ДобавитьТекстЗапросаПоАдресуЭП(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ИнформационныеКарты") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&АдресЭП,
	|	ЕСТЬNULL(ДисконтныеКарты.Ссылка, КонтрагентыКонтактнаяИнформация.Ссылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.АдресЭП)
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = ДисконтныеКарты.ВладелецКарты
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтрагентыКонтактнаяИнформация.АдресЭП = &АдресЭП";
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаДополнительныеОбъекты.
Процедура ДобавитьТекстЗапросаДополнительныеОбъекты(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	Если НЕ СУсловиемПоиска ИЛИ ФильтрПоискаПоШтрихкоду.Свойство("ФизическиеЛица") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Сотрудники.ШтрихКод,
		|	Сотрудники.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ЭтоГруппа
		|	И НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.Недействителен
		|	И &Условие";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие",
			?(СУсловиемПоиска, "Сотрудники.ШтрихКод = &Штрихкод",
				"НЕ Сотрудники.ШтрихКод = """" "));
			
		Если ФильтрПоискаПоШтрихкоду.Свойство("КассирДляВхода") Тогда
			ТекстЗапроса = ТекстЗапроса +
				"
				|И Сотрудники.Ссылка = &КассирДляВхода";
		КонецЕсли;

		МассивЗапросов.Добавить(ТекстЗапроса);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Сотрудники.МагнитныйКод,
		|	Сотрудники.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ЭтоГруппа
		|	И НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.Недействителен
		|	И &Условие";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие",
			?(СУсловиемПоиска, "Сотрудники.МагнитныйКод = &Штрихкод",
				"НЕ Сотрудники.МагнитныйКод = """" "));
			
		Если ФильтрПоискаПоШтрихкоду.Свойство("КассирДляВхода") Тогда
			ТекстЗапроса = ТекстЗапроса +
				"
				|И Сотрудники.Ссылка = &КассирДляВхода";
		КонецЕсли;
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если НЕ СУсловиемПоиска ИЛИ ФильтрПоискаПоШтрихкоду.Свойство("ИнформационныеКарты") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДисконтныеКарты.КодКартыШтрихкод,
		|	ДисконтныеКарты.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
		|ГДЕ
		|	НЕ ДисконтныеКарты.ПометкаУдаления
		|	И &Условие";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие",
			?(СУсловиемПоиска, "ДисконтныеКарты.КодКартыШтрихкод = &Штрихкод",
				"НЕ ДисконтныеКарты.КодКартыШтрихкод = """" "));  
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДисконтныеКарты.КодКартыМагнитный,
		|	ДисконтныеКарты.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
		|ГДЕ
		|	НЕ ДисконтныеКарты.ПометкаУдаления
		|	И &Условие";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие",
			?(СУсловиемПоиска, "ДисконтныеКарты.КодКартыМагнитный = &Штрихкод",
				"НЕ ДисконтныеКарты.КодКартыМагнитный = """" "));
			
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьПризнакВводаНеизвестнойКИ.
Процедура ЗаполнитьПризнакВводаНеизвестнойКИ(Форма, ДобавлятьНеизвестнуюКИ) Экспорт
	
	Если Форма.ИмяФормы = "ОбщаяФорма.АнализШтрихкодов" Тогда
		ДобавлятьНеизвестнуюКИ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьМассивСправочниковСКИ.
Процедура ЗаполнитьМассивСправочниковСКИ(СправочникиСКИ, ФильтрПоискаПоШтрихкоду) Экспорт
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	СправочникиСКИ.Добавить("Пользователи");
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьТаблицуШаблоновРегистрацииНовыхКарт.
Процедура ЗаполнитьТаблицуШаблоновРегистрацииНовыхКарт(Шаблоны) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДополнитьСтрокуТаблицыВыбора.
Процедура ДополнитьСтрокуТаблицыВыбора(НоваяСтрока, СтрокаВыбора) Экспорт
	
	ДополнительныеДанные = СтрокаВыбора.ДополнительныеДанные;
	
	Если ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		НоваяСтрока.ПредставлениеОбъекта =
			"" + СтрокаВыбора.Владелец
			+ ", " + СтрокаВыбора.Владелец.Владелец;
	ИначеЕсли ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.ПартииНоменклатуры") Тогда
			НоваяСтрока.ПредставлениеОбъекта =
			"" + СтрокаВыбора.Владелец
			+ ", " + СтрокаВыбора.Владелец.Владелец;
	ИначеЕсли ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.ДисконтныеКарты") Тогда
		КартаНедействительна = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаВыбора.Владелец, "КартаНедействительна");
		НоваяСтрока.КартаНедействительна = КартаНедействительна;
	ИначеЕсли ДополнительныеДанные.Свойство("Карта") Тогда
		НоваяСтрока.ПредставлениеОбъекта = СтрокаВыбора.Владелец;
		Если ДополнительныеДанные.Свойство("КартаНедействительна") Тогда
			НоваяСтрока.КартаНедействительна = ДополнительныеДанные.КартаНедействительна;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		НоваяСтрока.ПредставлениеОбъекта =
			"" + СтрокаВыбора.Владелец
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.Характеристика), ", " + СтрокаВыбора.Характеристика , "")
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.Упаковка), ", " + СтрокаВыбора.Упаковка, "")
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.СерияНоменклатуры), ", " + СтрокаВыбора.СерияНоменклатуры, "")
			+ ?(ЗначениеЗаполнено(ДополнительныеДанные.Партия), ", " + ДополнительныеДанные.Партия, "");
	ИначеЕсли ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
		НоваяСтрока.ПредставлениеОбъекта =
			"" + СтрокаВыбора.Номенклатура
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.Характеристика), ", " + СтрокаВыбора.Характеристика , "")
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.Упаковка), ", " + СтрокаВыбора.Упаковка, "")
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.СерияНоменклатуры), ", " + СтрокаВыбора.СерияНоменклатуры, "")
			+ ?(ЗначениеЗаполнено(ДополнительныеДанные.Партия), ", " + ДополнительныеДанные.Партия, "");
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьКодИКоличествоВесовогоТовара.
Процедура ЗаполнитьКодИКоличествоВесовогоТовара(Штрихкод, СтруктураВесовогоТовара) Экспорт
	
	ПрефиксыВесовыхШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.ПрефиксыВесовыхШтрихкодов();
	
	Если СтрДлина(Штрихкод) = 13 // EAN13
		И Лев(Штрихкод, 1) = "2" // Внутренний штрихкод
		И ПрефиксыВесовыхШтрихкодов.Найти(Сред(Штрихкод, 2, 1)) <> Неопределено Тогда // Найден префикс весового товара
		
		// Штрихкод является весовым, выполняем преобразование.
		// Формат весового штрихкода: 2 + П + ЧЧЧЧЧ + BBBBB + K
		// Где,
		//  П     - Префикс весового товара
		//  ЧЧЧЧЧ - код весового товара
		//  BBBBB - Вес
		//  К     - Контрольное число
		
		Вес = Число(Сред(Штрихкод, 8, 2)) + Число(Сред(Штрихкод, 10, 3)) / 1000;
		
		СтруктураВесовогоТовара = Новый Структура;
		СтруктураВесовогоТовара.Вставить("КодТовара", Число(Сред(Штрихкод, 3, 5)));
		СтруктураВесовогоТовара.Вставить("КоличествоТовара", Вес);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДополнительныеДанныеОбъектовВыборки.
Процедура ЗаполнитьДополнительныеДанныеОбъектовВыборки(СтруктураШтрихкода, Выборка) Экспорт 
	
	ТипВладельца = ТипЗнч(Выборка.Владелец);
	
	СтруктураШтрихкода.Вставить("Партия", Выборка.Партия);
	
	Если ТипВладельца = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
		СтруктураШтрихкода.Вставить("Номенклатура", Выборка.Владелец.Номенклатура);
		СтруктураШтрихкода.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураШтрихкода.Вставить("Упаковка", Выборка.Упаковка);
		СтруктураШтрихкода.Вставить("СерияНоменклатуры", Выборка.СерияНоменклатуры);
		СтруктураШтрихкода.Вставить("ВесИзШтрихкода", Истина);
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Номенклатура") Тогда
		СтруктураШтрихкода.Вставить("Номенклатура", Выборка.Владелец);
		СтруктураШтрихкода.Вставить("СерияНоменклатуры", Выборка.СерияНоменклатуры);
		Если Выборка.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.НоменклатураВесовой Тогда
			СтруктураШтрихкода.Вставить("ВесИзШтрихкода", Истина);
		КонецЕсли;
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.ДисконтныеКарты") Тогда
		ВладелецКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Владелец, "ВладелецКарты");
		СтруктураШтрихкода.Вставить("ВладелецКарты", ВладелецКарты);
		ДанныеДисконтнойКарты = ДисконтныеКартыУНФСервер.ПолучитьДанныеКарты(Выборка.Владелец);
		СтруктураШтрихкода.Вставить("Остаток", ДанныеДисконтнойКарты.ОстатокБаллов);
		СтруктураШтрихкода.Вставить("ПродажиОборот", ДанныеДисконтнойКарты.ПродажиОборот);
	ИначеЕсли ТипВладельца = Тип("Неопределено") Тогда
		Если Выборка.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.Телефон Тогда
			СтруктураШтрихкода.Вставить("НомерТелефона", Выборка.Штрихкод);
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураШтрихкода.Свойство("Номенклатура") Тогда
		СтруктураШтрихкода.Вставить("ОтображатьОстатки", Истина);
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьОстаткиПоСкладу.
Процедура ЗаполнитьОстаткиПоСкладу(ТаблицаНоменклатурыДляОстатков,
	СкладОстатков, ТаблицаОстатков) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатуры.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	&ИсходныеДанные КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
	|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка = &Магазин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ПОМЕСТИТЬ ТаблицаСклады
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
	|ГДЕ
	|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
	|ГДЕ
	|	(ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|			ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	СУММА(Остатки.Количество) КАК Остаток,
	|	СУММА(Остатки.Резерв) КАК Резерв
	|ПОМЕСТИТЬ ОстаткиНоменклатуры
	|ИЗ
	|	РегистрСведений.ОстаткиТоваров КАК Остатки
	|ГДЕ
	|	Остатки.СтруктурнаяЕдиница В
	|			(ВЫБРАТЬ
	|				ТаблицаСклады.Склад КАК Склад
	|			ИЗ
	|				ТаблицаСклады КАК ТаблицаСклады)
	|	И (Остатки.Номенклатура, Остатки.Характеристика) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|				ТаблицаНоменклатуры.Характеристика КАК Характеристика
	|			ИЗ
	|				ТаблицаНоменклатуры КАК ТаблицаНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
	|	Остатки.Остаток / ВЫБОР
	|		КОГДА ТаблицаНоменклатуры.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
	|			ТОГДА ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Остаток,
	|	Остатки.Резерв / ВЫБОР
	|		КОГДА ТаблицаНоменклатуры.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
	|			ТОГДА ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Резерв
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТаблицаНоменклатуры.Упаковка = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиНоменклатуры КАК Остатки
	|		ПО ТаблицаНоменклатуры.Номенклатура = Остатки.Номенклатура
	|			И ТаблицаНоменклатуры.Характеристика = Остатки.Характеристика");
	
	Запрос.УстановитьПараметр("ИсходныеДанные", ТаблицаНоменклатурыДляОстатков);
	Запрос.УстановитьПараметр("Магазин", СкладОстатков);
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьТекущийСклад.
Процедура ЗаполнитьТекущийСклад(ТекущийСклад) Экспорт
	
	ТекущийСклад = Справочники.СтруктурныеЕдиницы.ОсновнойСклад();
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДополнитьСтруктуруРезультатами.
Процедура СкорректироватьСтруктуруРезультата(
			СтруктураПараметров,
			Штрихкод,
			СтруктураДействий,
			НеизвестныеДанныеПО,
			ВозможнаРегистрацияНовойНоменклатуры) Экспорт
			
	Возврат;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДополнитьПараметрыЗапросаПоиска.
Процедура ДополнитьПараметрыЗапросаПоиска(Запрос, Форма, ДополнительныеПараметры) Экспорт
	
	Если Запрос.Параметры.Свойство("КодТовара") Тогда
		КоличествоТовара = Запрос.Параметры.КоличествоТовара;
		Если КоличествоТовара > 0 Тогда
			КодТовара = Запрос.Параметры.КодТовара;
			ПрефиксШК = Сред(Запрос.Параметры.Штрихкод, 2, 1);
			ШтрихкодТовара = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШтрихкодВесовогоТовараПоКоду(КодТовара, ПрефиксШК);
		Иначе
			ШтрихкодТовара = "";
		КонецЕсли;
		Запрос.УстановитьПараметр("ШтрихкодСНулевымВесом", ШтрихкодТовара);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "ОбщаяФорма.АнализШтрихкодов" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФильтрПоискаПоШтрихкоду") Тогда
		Возврат
	КонецЕсли;
	
	ФильтрПоискаПоШтрихкоду = Форма.ФильтрПоискаПоШтрихкоду;
	Если НЕ ФильтрПоискаПоШтрихкоду = Неопределено Тогда
		НоменклатураДляПоискаСерии = Неопределено;
		ФильтрПоискаПоШтрихкоду.Свойство("СерииНоменклатуры", НоменклатураДляПоискаСерии);
		Запрос.УстановитьПараметр("НоменклатураДляПоискаСерии", НоменклатураДляПоискаСерии);
		
		МассивУжеДобавленныхСерий = Неопределено;
		ФильтрПоискаПоШтрихкоду.Свойство("МассивУжеДобавленныхСерий", МассивУжеДобавленныхСерий);
		Запрос.УстановитьПараметр("МассивУжеДобавленныхСерий", МассивУжеДобавленныхСерий);
		
		КассирДляВхода = Неопределено;
		ФильтрПоискаПоШтрихкоду.Свойство("КассирДляВхода", КассирДляВхода);
		Запрос.УстановитьПараметр("КассирДляВхода", КассирДляВхода);
		
		ЗаданнаяТаблицаНоменклатуры = Неопределено;
		ФильтрПоискаПоШтрихкоду.Свойство("ЗаданнаяТаблицаНоменклатуры", ЗаданнаяТаблицаНоменклатуры);
		Запрос.УстановитьПараметр("ЗаданнаяТаблицаНоменклатуры", ЗаданнаяТаблицаНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьФильтрПоискаПоУмолчанию.
Процедура ЗаполнитьФильтрПоискаПоУмолчанию(ФильтрПоискаПоУмолчанию) Экспорт
	
	ФильтрПоискаПоШтрихкоду = Новый Структура;
	ФильтрПоискаПоШтрихкоду.Вставить("Номенклатура");
	
	ФильтрПоискаПоШтрихкоду.Вставить("ФизическиеЛица");
	ФильтрПоискаПоШтрихкоду.Вставить("ИнформационныеКарты");
	
	ФильтрПоискаПоУмолчанию = ФильтрПоискаПоШтрихкоду;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ОпределитьФильтрПоискаШтрихкода.
Процедура ОпределитьФильтрПоискаШтрихкода(Форма) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.НастроитьФормуАнализаШтрихкодов.
Процедура НастроитьФормуАнализаШтрихкодов(Форма) Экспорт
	
	Форма.Элементы.ТаблицаОшибокУпаковка.Заголовок = НСтр("ru='Единица измерения'");
	Форма.Элементы.ТаблицаШаблоновДополнительноеОписание.Видимость = Ложь;
	Форма.Элементы.ТаблицаОшибокПартия.Видимость = Истина;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДанныеПоискаПоШтрихкоду.
Процедура ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, Форма, ДанныеШтрихкода) Экспорт
	
	ДанныеШтрихкода = РаботаСоШтрихкодами.ДанныеПоискаПоШтрихкоду(Штрихкод, Форма);
	
КонецПроцедуры

// Настраивает подключаемое оборудование в форме,
// устанавливает флаг ИспользоватьПодключаемоеОборудование в форме.
//
// Параметры:
//  Форма - УправляемаяФорма - форма в которой настраивается подключение оборудования.
//
Процедура НастроитьПодключаемоеОборудование(Форма) Экспорт
	
	МенеджерОборудованияРМК.НастроитьПодключаемоеОборудование(Форма);
	
КонецПроцедуры

#КонецОбласти
